In [ ]:
!pip install pandas==0.25.1 --user
!pip install scikit-learn==0.21.3 --user
!pip install statsmodels==0.11.1 --user

## https://github.com/encaion/SE_ProDS : 전처리 기출
## 블로그에 기출 하나 더 있음

In [1]:
import pandas as pd
import numpy as np

In [40]:
df_s = pd.DataFrame(dict(col1 = [100, 200, 300],
                        col2 = ["a", "b", "c"],
                        shape =["A", "B", "C"]))
df_s

   col1 col2 shape
0   100    a     A
1   200    b     B
2   300    c     C

In [3]:
df_s.col1
df_s["col1"]

0    100
1    200
2    300
Name: col1, dtype: int64

In [4]:
df_s.shape

(3, 3)

In [5]:
df_s["shape"]

0    A
1    B
2    C
Name: shape, dtype: object

In [9]:
df_s["shape"][:2]

0    A
1    B
Name: shape, dtype: object

In [11]:
df_s.loc[:1,"shape"]

0    A
1    B
Name: shape, dtype: object

In [12]:
df_s.iloc[:2,]

   col1 col2 shape
0   100    a     A
1   200    b     B

In [18]:
df_s.loc[:2,]

   col1 col2 shape
0   100    a     A
1   200    b     B
2   300    c     C

# columns 이름 바꾸기

In [32]:
df_s = df_s.rename(columns = {"col1" : "v1", "col2" : "v2"})
df_s

   v1_s_s v2_s_s shape_s_s
0     100      a         A
1     200      b         B
2     300      c         C

In [35]:
df_s.columns = ["col1", "col2", "shape"]
df_s

   col1 col2 shape
0   100    a     A
1   200    b     B
2   300    c     C

# 변수에 접미사 붙이기

In [36]:
df_s.columns = df_s.columns + "_s"
df_s

   col1_s col2_s shape_s
0     100      a       A
1     200      b       B
2     300      c       C

In [37]:
df_c1 = pd.DataFrame([[1,2,3,4,5]])
df_c1

   0  1  2  3  4
0  1  2  3  4  5

In [39]:
df_c1.columns = df_c1.columns.astype("str") + "_s"
df_c1

   0_s  1_s  2_s  3_s  4_s
0    1    2    3    4    5

In [51]:
df_c2 = pd.DataFrame([[1,2,3,4,5]])

In [53]:
df_c2.columns = df_c2.columns.astype("str")
df_c2

   0  1  2  3  4
0  1  2  3  4  5

In [56]:
df_c2.columns = list(df_c2.columns[:2]+"_s") + list(df_c2.columns[2:])
df_c2

   0_s  1_s  2  3  4
0    1    2  3  4  5

# 필터링

In [42]:
df_s.loc[df_s["col1"] == 100,]

   col1 col2 shape
0   100    a     A

In [44]:
df_s.loc[(df_s["col1"] == 100) | (df_s["col2"] == "b"),]

   col1 col2 shape
0   100    a     A
1   200    b     B

In [45]:
condi_1 = df_s["col1"] ==100
condi_2 = df_s["col2"] == "b"
df_s.loc[condi_1|condi_2,]

   col1 col2 shape
0   100    a     A
1   200    b     B

In [47]:
df_s.loc[df_s["col1"].isin([100,300]),]

   col1 col2 shape
0   100    a     A
2   300    c     C

# csv 읽기

In [57]:
df = pd.read_csv("krx_202105_utf8.csv")
df.head(2)

,지수명,종가,대비,등락률,시가,고가,저가,거래량,거래대금,상장시가총액,날짜
0,KRX 300,1901.05,-11.63,-0.61,1913.15,1929.94,1896.65,279548840,13488481375036,2028800954161500,20210503
1,KTOP 30,11520.28,-86.30,-0.74,11609.44,11702.14,11490.84,50048566,5645660149606,1208343758559140,20210503

In [72]:
df_sub = df.loc[df["지수명"]=="KTOP 30",]
df_sub.head(2)

,지수명,종가,대비,등락률,시가,고가,저가,거래량,거래대금,상장시가총액,날짜
1,KTOP 30,11520.28,-86.30,-0.74,11609.44,11702.14,11490.84,50048566,5645660149606,1208343758559140,20210503
30,KTOP 30,11648.25,127.97,1.11,11533.33,11648.25,11460.14,38961631,4838149503094,1221601529899840,20210504

In [61]:
df["지수명"].unique()

array(['KRX 300', 'KTOP 30', 'KRX 100', 'KRX Mid 200', 'KRX 자동차',
       'KRX 반도체', 'KRX 헬스케어', 'KRX 은행', 'KRX 에너지화학', 'KRX 철강', 'KRX 방송통신',
       'KRX 건설', 'KRX 증권', 'KRX 기계장비', 'KRX 보험', 'KRX 운송', 'KRX 경기소비재',
       'KRX 필수소비재', 'KRX 미디어&엔터테인먼트', 'KRX 정보기술', 'KRX 유틸리티',
       'KRX 300 정보기술', 'KRX 300 금융', 'KRX 300 자유소비재', 'KRX 300 산업재',
       'KRX 300 헬스케어', 'KRX 300 커뮤니케이션서비스', 'KRX 300 소재', 'KRX 300 필수소비재'],
      dtype=object)

In [66]:
df.loc[df["종가"] ==df["종가"].max(), ["지수명", "종가","날짜"]]

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

In [67]:
df["종가"].idxmax()

117

In [68]:
df.loc[123,["지수명", "종가","날짜"]]

지수명      KRX 은행
종가       803.37
날짜     20210510
Name: 123, dtype: object

In [69]:
df.loc[df["종가"].idxmax(), ["지수명", "종가","날짜"]]

지수명     KTOP 30
종가     11869.29
날짜     20210510
Name: 117, dtype: object

In [70]:
df.loc[[df["종가"].idxmax()], ["지수명", "종가","날짜"]]

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

# 기출 유형 (날짜별로 등락률이 높은 지수명을 새로 표시)

In [92]:
df["date"]  = pd.to_datetime(df["날짜"].astype("str"))
df.head(2)

,지수명,종가,대비,등락률,시가,고가,저가,거래량,거래대금,상장시가총액,날짜,date
0,KRX 300,1901.05,-11.63,-0.61,1913.15,1929.94,1896.65,279548840,13488481375036,2028800954161500,20210503,2021-05-03
1,KTOP 30,11520.28,-86.30,-0.74,11609.44,11702.14,11490.84,50048566,5645660149606,1208343758559140,20210503,2021-05-03

In [81]:
df_agg = df.groupby("date")["등락률"].max().reset_index()
df_agg.head(2)

        date   등락률
0 2021-05-03  2.12
1 2021-05-04  1.92

In [82]:
df_join = pd.merge(df_agg, df[["date","등락률","지수명"]],
                  on = ["date", "등락률"], how = "inner")
df_join.head(2)

        date   등락률        지수명
0 2021-05-03  2.12    KRX 자동차
1 2021-05-04  1.92  KRX 에너지화학

In [83]:
len(df_join)

19

In [94]:
# shift + tab + tab 이 먹히지 않으면
print(df_agg.merge.__doc__)

Merge DataFrame or named Series objects with a database-style join.

A named Series object is treated as a DataFrame with a single named column.

The join is done on columns or indexes. If joining columns on
columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
on indexes or indexes on a column or columns, the index will be passed on.
When performing a cross merge, no column specifications to merge on are
allowed.

.. warning::

    If both key columns contain rows where the key is a null value, those
    rows will be matched against each other. This is different from usual SQL
    join behaviour and can lead to unexpected results.

Parameters
----------
right : DataFrame or named Series
    Object to merge with.
how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
    Type of merge to be performed.

    * left: use only keys from left frame, similar to a SQL left outer join;
      preserve key order.
    * right: use only keys from right frame, similar to a SQL right outer join;
      preserve key order.
    * outer: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically.
    * inner: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys.
    * cross: creates the cartesian product from both frames, preserves the order
      of the left keys.

      .. versionadded:: 1.2.0

on : label or list
    Column or index level names to join on. These must be found in both
    DataFrames. If `on` is None and not merging on indexes then this defaults
    to the intersection of the columns in both DataFrames.
left_on : label or list, or array-like
    Column or index level names to join on in the left DataFrame. Can also
    be an array or list of arrays of the length of the left DataFrame.
    These arrays are treated as if they are columns.
right_on : label or list, or array-like
    Column or index level names to join on in the right DataFrame. Can also
    be an array or list of arrays of the length of the right DataFrame.
    These arrays are treated as if they are columns.
left_index : bool, default False
    Use the index from the left DataFrame as the join key(s). If it is a
    MultiIndex, the number of keys in the other DataFrame (either the index
    or a number of columns) must match the number of levels.
right_index : bool, default False
    Use the index from the right DataFrame as the join key. Same caveats as
    left_index.
sort : bool, default False
    Sort the join keys lexicographically in the result DataFrame. If False,
    the order of the join keys depends on the join type (how keyword).
suffixes : list-like, default is ("_x", "_y")
    A length-2 sequence where each element is optionally a string
    indicating the suffix to add to overlapping column names in
    `left` and `right` respectively. Pass a value of `None` instead
    of a string to indicate that the column name from `left` or
    `right` should be left as-is, with no suffix. At least one of the
    values must not be None.
copy : bool, default True
    If False, avoid copy if possible.
indicator : bool or str, default False
    If True, adds a column to the output DataFrame called "_merge" with
    information on the source of each row. The column can be given a different
    name by providing a string argument. The column will have a Categorical
    type with the value of "left_only" for observations whose merge key only
    appears in the left DataFrame, "right_only" for observations
    whose merge key only appears in the right DataFrame, and "both"
    if the observation's merge key is found in both DataFrames.

validate : str, optional
    If specified, checks if merge is of specified type.

    * "one_to_one" or "1:1": check if merge keys are unique in both
      left and right datasets.
    * "one_to_many" or "1:m": check if merge keys are unique in left
      dataset.
    * "many_to_one" or "m:1": check if merge keys are unique in right
      dataset.
    * "many_to_many" or "m:m": allowed, but does not result in checks.

Returns
-------
DataFrame
    A DataFrame of the two merged objects.

See Also
--------
merge_ordered : Merge with optional filling/interpolation.
merge_asof : Merge on nearest keys.
DataFrame.join : Similar method using indices.

Notes
-----
Support for specifying index levels as the `on`, `left_on`, and
`right_on` parameters was added in version 0.23.0
Support for merging named Series objects was added in version 0.24.0

Examples
--------
>>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [1, 2, 3, 5]})
>>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})
>>> df1
    lkey value
0   foo      1
1   bar      2
2   baz      3
3   foo      5
>>> df2
    rkey value
0   foo      5
1   bar      6
2   baz      7
3   foo      8

Merge df1 and df2 on the lkey and rkey columns. The value columns have
the default suffixes, _x and _y, appended.

>>> df1.merge(df2, left_on='lkey', right_on='rkey')
  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

Merge DataFrames df1 and df2 with specified left and right suffixes
appended to any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey',
...           suffixes=('_left', '_right'))
  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
Traceback (most recent call last):
...
ValueError: columns overlap but no suffix specified:
    Index(['value'], dtype='object')

>>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
>>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
>>> df1
      a  b
0   foo  1
1   bar  2
>>> df2
      a  c
0   foo  3
1   baz  4

>>> df1.merge(df2, how='inner', on='a')
      a  b  c
0   foo  1  3

>>> df1.merge(df2, how='left', on='a')
      a  b  c
0   foo  1  3.0
1   bar  2  NaN

>>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
>>> df2 = pd.DataFrame({'right': [7, 8]})
>>> df1
    left
0   foo
1   bar
>>> df2
    right
0   7
1   8

>>> df1.merge(df2, how='cross')
   left  right
0   foo      7
1   foo      8
2   bar      7
3   bar      8

In [95]:
# 어떤 객체의 메서드, 어트리뷰트 같은 것의 목록을 보고자 할 때 dir() 함수가 매우 유용
dir(df_agg)

['T',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__dataframe__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_accum_func',
 '_add_numeric_operations',
 '_agg_examples_doc',
 '_agg_summary_and_see_also_doc',
 '_align_frame',
 '_align_series',
 '_append',
 '_arith_method',
 '_as_manager',
 '_attrs',
 '_box_col_values',
 '_can_fast_transpose',
 '_check_inplace_and_allows_duplicate_labels',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_cmp_method',
 '_combine_frame',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_result',
 '_constructor',
 '_constructor_sliced',
 '_create_data_for_split_and_tight_to_dict',
 '_data',
 '_dir_additions',
 '_dir_deletions',
 '_dispatch_frame_op',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_flags',
 '_from_arrays',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cleaned_column_resolvers',
 '_get_column_array',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_getitem_nocopy',
 '_gotitem',
 '_hidden_attrs',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_inplace_method',
 '_internal_names',
 '_internal_names_set',
 '_is_copy',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_iset_item',
 '_iset_item_mgr',
 '_iset_not_inplace',
 '_item_cache',
 '_iter_column_arrays',
 '_ixs',
 '_join_compat',
 '_logical_func',
 '_logical_method',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_mgr',
 '_min_count_stat_function',
 '_needs_reindex_multi',
 '_protect_consolidate',
 '_reduce',
 '_reduce_axis1',
 '_reindex_axes',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_rename',
 '_replace_columnwise',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_series',
 '_set_axis',
 '_set_axis_name',
 '_set_axis_nocheck',
 '_set_is_copy',
 '_set_item',
 '_set_item_frame_value',
 '_set_item_mgr',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_stat_function',
 '_stat_function_ddof',
 '_take',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_to_latex_via_styler',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'backfill',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'date',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isetitem',
 'isin',
 'isna',
 'isnull',
 'items',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_flags',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_orc',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'to_xml',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'where',
 'xs',
 '등락률']

In [96]:
import sklearn.metrics as sm ## 라이브러리 이름 생각 안 날 때
[f for f in dir(sm) if f[-5:] == "score"]

['accuracy_score',
 'adjusted_mutual_info_score',
 'adjusted_rand_score',
 'average_precision_score',
 'balanced_accuracy_score',
 'calinski_harabasz_score',
 'cohen_kappa_score',
 'completeness_score',
 'consensus_score',
 'd2_absolute_error_score',
 'd2_pinball_score',
 'd2_tweedie_score',
 'davies_bouldin_score',
 'dcg_score',
 'explained_variance_score',
 'f1_score',
 'fbeta_score',
 'fowlkes_mallows_score',
 'homogeneity_score',
 'jaccard_score',
 'label_ranking_average_precision_score',
 'mutual_info_score',
 'ndcg_score',
 'normalized_mutual_info_score',
 'precision_score',
 'r2_score',
 'rand_score',
 'recall_score',
 'roc_auc_score',
 'silhouette_score',
 'top_k_accuracy_score',
 'v_measure_score']

# 결측치 처리

In [101]:
df = pd.read_csv("iris_missing.csv")
df_sub = df.head()

In [98]:
df_sub.info() #결측이 아닌 것의 개수

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  5 non-null      float64
 1   Sepal.Width   4 non-null      float64
 2   Petal.Length  4 non-null      float64
 3   Petal.Width   5 non-null      float64
 4   Species       5 non-null      object
dtypes: float64(4), object(1)
memory usage: 332.0+ bytes

In [99]:
df_sub.count() # 결측이 아닌 것의 개수

Sepal.Length    5
Sepal.Width     4
Petal.Length    4
Petal.Width     5
Species         5
dtype: int64

In [103]:
len(df_sub) - df_sub.count() # 결측 개수

Sepal.Length    0
Sepal.Width     1
Petal.Length    1
Petal.Width     0
Species         0
dtype: int64

In [104]:
df_sub.isna()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
0         False         True          True        False    False
1         False        False         False        False    False
2         False        False         False        False    False
3         False        False         False        False    False
4         False        False         False        False    False

In [105]:
df_sub.isna().sum() #결측 개수, 이게 좀 더 많이 사용

Sepal.Length    0
Sepal.Width     1
Petal.Length    1
Petal.Width     0
Species         0
dtype: int64

In [106]:
df_sub.dropna() # 결측이 있으면 그냥 없애버리기

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [107]:
df_sub.loc[df_sub["Sepal.Width"].isna()]

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa

# **Q. Sepal.Width의 결측치는 0으로 대치하고 Petal.Length의 결측치는 해당 변수의 평균값으로 대체

In [108]:
df_sub["Sepal.Width"] = df_sub["Sepal.Width"].fillna(0)
df_sub["Petal.Length"] = df_sub["Petal.Length"].fillna(df_sub["Petal.Length"].mean())

C:\Users\minji\AppData\Local\Temp\ipykernel_2560\399177346.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sub["Sepal.Width"] = df_sub["Sepal.Width"].fillna(0)

그런데... 위 코드를 실행하면 뭔가 빨간 메세지가 나옴... ㅜ
해당 빨간 메세지는 경고 메세지 : 인덱스 문제 때문에 발생

상기 문제를 해결하는 방법은 크게 2가지
> 1. 경고메세지를 모두 꺼버리기
> 2. 복사 또는 인덱스 초기화를 활용

### \[기출예제\] 결측값이 있는 경우 해당 결측값의 앞과 뒤 원소 하나씩을 선택하여 해당 원소들의 평균값으로 결측값을 대치하시오
단, 결측값은 연속으로 있지 않음

In [114]:
df_i = pd.DataFrame(dict(v= [100,200,300,np.nan,500,600,700]))
df_i["v_s1"] = df_i["v"].shift(1) #값을 밀고
df_i["v_sn1"] = df_i["v"].shift(-1) # 값을 당김
df_i["v_fill1"] = np.where(df_i["v"].isna(), (df_i["v_s1"] + df_i["v_sn1"]) / 2, df_i["v"])
df_i["v_fill2"] = df_i["v"].interpolate() # 보간법 - 선형보간이 기본 동작
df_i

       v   v_s1  v_sn1  v_fill1  v_fill2
0  100.0    NaN  200.0    100.0    100.0
1  200.0  100.0  300.0    200.0    200.0
2  300.0  200.0    NaN    300.0    300.0
3    NaN  300.0  500.0    400.0    400.0
4  500.0    NaN  600.0    500.0    500.0
5  600.0  500.0  700.0    600.0    600.0
6  700.0  600.0    NaN    700.0    700.0

# index

In [118]:
# 이 방법은 기존의 index를 쓸 필요가 없을 때 사용
# 특히, 머신러닝 지도학습 모델링 실시 할 때 종속변수를 맨 앞으로 옮길 때 유용
df_sub.set_index("Species").reset_index()

  Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0  setosa           5.1          0.0           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

# 범주형 변수

In [119]:
df = pd.read_csv("bike.csv")
df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [120]:
df["season"].unique()

array([1, 2, 3, 4], dtype=int64)

In [123]:
df["season"].nunique() #number of unique

4

In [124]:
df["season"].value_counts() # 각 원소가 몇 개가 있냐

season
4    2734
2    2733
3    2733
1    2686
Name: count, dtype: int64

In [126]:
df["season"].value_counts(normalize=True) #정규화를 함으로써 비율 확인

season
4    0.251148
2    0.251056
3    0.251056
1    0.246739
Name: proportion, dtype: float64

In [127]:
pd.crosstab(df["season"], df["holiday"]) #두 columns의 조합

holiday     0   1
season
1        2615  71
2        2685  48
3        2637  96
4        2638  96

In [133]:
df_sub = df.loc[(df["season"] == 2)&(df["holiday"] == 0)]
len(df_sub)

2685

In [128]:
pd.crosstab(df["season"], df["holiday"], normalize = "index")

holiday         0         1
season
1        0.973567  0.026433
2        0.982437  0.017563
3        0.964874  0.035126
4        0.964887  0.035113

In [142]:
#season 별 holiday별 count의 합
pd.crosstab(df["season"], df["holiday"], values = df["count"], aggfunc="sum")

holiday       0      1
season
1        307249   5249
2        578786   9496
3        617831  22831
4        523802  20232

In [139]:
df.groupby(["season","holiday"])["count"].sum().reset_index()

   season  holiday   count
0       1        0  307249
1       1        1    5249
2       2        0  578786
3       2        1    9496
4       3        0  617831
5       3        1   22831
6       4        0  523802
7       4        1   20232

In [138]:
df.pivot_table(index = "season", columns ="holiday", values = "count", aggfunc = "sum")

holiday       0      1
season
1        307249   5249
2        578786   9496
3        617831  22831
4        523802  20232

### \[기출 유형\] .agg()와 딕셔너리를 활용하여 보다 간결하게 '.groupby()' 사용하기

In [146]:
df.groupby("holiday")[["temp","atemp"]].agg({"temp":"mean",
                                             'atemp':"max"}).reset_index()

   holiday       temp   atemp
0        0  20.230466  45.455
1        1  20.244244  42.425

In [148]:
df.groupby("holiday")[["temp","atemp"]].agg({"temp":["mean","max"],
                                             'atemp':"max"}).reset_index()

  holiday       temp          atemp
                mean    max     max
0       0  20.230466  41.00  45.455
1       1  20.244244  37.72  42.425

## 텍스트 처리

In [151]:
df_t = pd.DataFrame(dict(v1 = [100,200,300],
                         t1 = ["aaa","abc", "ccc"],
                         t2 = [123, "123-456","010-1234-5678"]))
df_t

    v1   t1             t2
0  100  aaa            123
1  200  abc        123-456
2  300  ccc  010-1234-5678

In [153]:
df_t["t1"].replace("a","❤")

0    aaa
1    abc
2    ccc
Name: t1, dtype: object

In [154]:
df_t["t1"].replace("aaa","❤")

0      ❤
1    abc
2    ccc
Name: t1, dtype: object

In [157]:
df_t["t1"].str.replace("a","🧡")

0    🧡🧡🧡
1    🧡bc
2    ccc
Name: t1, dtype: object

In [156]:
df_t["t1"].str.replace("aaa","💙")

0      💙
1    abc
2    ccc
Name: t1, dtype: object

In [160]:
df_t["t1"].replace({"aaa":"💙","ccc":"💜"})

0      💙
1    abc
2      💜
Name: t1, dtype: object

In [161]:
df_t["t1"].str.contains("a")

0     True
1     True
2    False
Name: t1, dtype: bool

In [162]:
df_t.loc[df_t["t1"].str.contains("a")] #a 포함한거

    v1   t1       t2
0  100  aaa      123
1  200  abc  123-456

In [166]:
df_t.loc[df_t["t1"].str.contains("^[^a]*?$")]
#처음부터 끝까지 a가 아닌 문자로 구성된 원소, 정규식은 어려우니까 '~'
df_t.loc[~df_t["t1"].str.contains("a")]

    v1   t1             t2
2  300  ccc  010-1234-5678

In [168]:
df_t["t2"].str.split("-")

0                  NaN
1           [123, 456]
2    [010, 1234, 5678]
Name: t2, dtype: object

In [169]:
df_t["t2"].astype("str").str.split("-")

0                [123]
1           [123, 456]
2    [010, 1234, 5678]
Name: t2, dtype: object

In [170]:
#원소가 리스트인 경우 그 리스트 구조를 풀어버림
df_t["t2"].astype("str").str.split("-").explode()

0     123
1     123
1     456
2     010
2    1234
2    5678
Name: t2, dtype: object

In [172]:
df_t_s = df_t["t2"].astype("str").str.split("-", expand = True)

In [173]:
df_t_s.fillna(-999)

     0     1     2
0  123  -999  -999
1  123   456  -999
2  010  1234  5678

In [174]:
df_t_s.columns = "t2_" + df_t_s.columns.astype("str")
df_t_s

  t2_0  t2_1  t2_2
0  123  None  None
1  123   456  None
2  010  1234  5678

In [175]:
df_t["t2"].str.len()

0     NaN
1     7.0
2    13.0
Name: t2, dtype: float64

In [176]:
df_t["t1"].str.replace("c","") #c를 없애는 코드

0    aaa
1     ab
2
Name: t1, dtype: object

In [194]:
pd.concat([df_t, df_t_s])

,datetime,year,month,hour,date,yyyymm,mmdd,wday,wend,t2_0,t2_1,t2_2
0,2011-01-01 00:00:00,2011.0,1.0,0.0,2011-01-01,201101,01-01,5.0,1.0,NaN,NaN,NaN
1,2011-01-01 01:00:00,2011.0,1.0,1.0,2011-01-01,201101,01-01,5.0,1.0,NaN,NaN,NaN
2,2011-01-01 02:00:00,2011.0,1.0,2.0,2011-01-01,201101,01-01,5.0,1.0,NaN,NaN,NaN
3,2011-01-01 03:00:00,2011.0,1.0,3.0,2011-01-01,201101,01-01,5.0,1.0,NaN,NaN,NaN
4,2011-01-01 04:00:00,2011.0,1.0,4.0,2011-01-01,201101,01-01,5.0,1.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
10884,2012-12-19 22:00:00,2012.0,12.0,22.0,2012-12-19,201212,12-19,2.0,0.0,NaN,NaN,NaN
10885,2012-12-19 23:00:00,2012.0,12.0,23.0,2012-12-19,201212,12-19,2.0,0.0,NaN,NaN,NaN
0,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,123,None,None
1,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,123,456,None
2,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,010,1234,5678

### 시간 데이터 핸들링

In [181]:
ser_t1 = pd.Series(["2023-10-25","2023-10-26","2023-10-27"])
ser_t2 = pd.Series(["2023년 10월 25일", "2023년 10월 26일", "2023년 10월 27일"])
ser_t3 = pd.Series([123456, 234567,345678])

In [182]:
pd.to_datetime(ser_t1)

0   2023-10-25
1   2023-10-26
2   2023-10-27
dtype: datetime64[ns]

In [183]:
pd.to_datetime(ser_t2) # Error!

C:\Users\minji\AppData\Local\Temp\ipykernel_2560\1074551062.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.to_datetime(ser_t2)

DateParseError: Unknown datetime string format, unable to parse: 2023년 10월 25일, at position 0

In [184]:
pd.to_datetime(ser_t2, format = "%Y년 %m월 %d일")

0   2023-10-25
1   2023-10-26
2   2023-10-27
dtype: datetime64[ns]

In [185]:
pd.to_datetime(ser_t3)

0   1970-01-01 00:00:00.000123456
1   1970-01-01 00:00:00.000234567
2   1970-01-01 00:00:00.000345678
dtype: datetime64[ns]

In [178]:
pd.to_datetime(ser_t3, origin = "2023-10-25")

0   2023-10-25 00:00:00.000123456
1   2023-10-25 00:00:00.000234567
2   2023-10-25 00:00:00.000345678
dtype: datetime64[ns]

In [180]:
pd.to_datetime(ser_t3, origin = "2023-10-25", unit = "s")

0   2023-10-26 10:17:36
1   2023-10-27 17:09:27
2   2023-10-29 00:01:18
dtype: datetime64[ns]

In [189]:
df = pd.read_csv("bike.csv")
df_t = df[["datetime"]].copy()
df_t.head(2)

              datetime
0  2011-01-01 00:00:00
1  2011-01-01 01:00:00

In [195]:
df_t["datetime"] = pd.to_datetime(df_t["datetime"])
df_t["year"] = df_t["datetime"].dt.year
df_t["month"] = df_t["datetime"].dt.month
df_t["hour"] = df_t["datetime"].dt.hour
df_t["date"] = df_t["datetime"].dt.date
df_t["yyyymm"] = df_t["datetime"].dt.strftime("%Y%m")
df_t["mmdd"] = df_t["datetime"].dt.strftime("%m-%d")
df_t["wday"] = df_t["datetime"].dt.weekday
df_t["wend"] = np.where(df_t["wday"] >=5,1,0) #주말1, 평일 0

In [196]:
df_t.head(2)

,datetime,year,month,hour,date,yyyymm,mmdd,wday,wend
0,2011-01-01 00:00:00,2011,1,0,2011-01-01,201101,01-01,5,1
1,2011-01-01 01:00:00,2011,1,1,2011-01-01,201101,01-01,5,1

### numpy 사용법

In [199]:
np.exp(1) #로지스틱 회귀 odds ratio(승산비)

2.718281828459045

In [200]:
np.where(np.array([1,2,3])==2, "a","b")

array(['b', 'a', 'b'], dtype='<U1')

In [201]:
np.log(np.exp(1))

1.0

In [202]:
np.log10(100)

2.0

In [203]:
np.r_[:4, 5, 7, 8:11]

array([ 0,  1,  2,  3,  5,  7,  8,  9, 10])

### Melt

In [205]:
df_e = pd.read_csv("elec_load_2017_7d.csv")
df_e.head(2)

,YEAR,MONTH,DAY,X1HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,...,X15HR,X16HR,X17HR,X18HR,X19HR,X20HR,X21HR,X22HR,X23HR,X24HR
0,2017,1,1,60178,57862,56165,55135,54450,54401,54147,...,49213,49357,50362,53115,55205,55437,55348,55790,58195,59330
1,2017,1,2,57067,55148,53983,53571,54027,55388,57753,...,72228,71945,72641,73387,72294,69989,67893,66504,67435,69275

In [210]:
df_e_m = df_e.melt(id_vars = ["YEAR", "MONTH", "DAY"],
                  var_name = "HOUR", value_name = "LOAD")
df_e_m.head(2)

   YEAR  MONTH  DAY  HOUR   LOAD
0  2017      1    1  X1HR  60178
1  2017      1    2  X1HR  57067

In [209]:
df_e_m = df_e.melt(id_vars = df_e.columns[:3],
                  var_name = "HOUR", value_name = "LOAD")
df_e_m.head(2)

   YEAR  MONTH  DAY  HOUR   LOAD
0  2017      1    1  X1HR  60178
1  2017      1    2  X1HR  57067

In [213]:
df_e_m["h1"] = df_e_m["HOUR"].str.replace("X","")
df_e_m["h1"] = df_e_m["HOUR"].str.replace("HR","")
df_e_m["h1"] = df_e_m["HOUR"].str.replace("X|HR","", regex = True)
df_e_m["h1"] = df_e_m["HOUR"].str.replace("[A-Z]","", regex = True)
df_e_m["h1"] = df_e_m["HOUR"].str.replace("[^0-9]","", regex = True)

In [214]:
df_e_m

     YEAR  MONTH  DAY   HOUR   LOAD  h1
0    2017      1    1   X1HR  60178   1
1    2017      1    2   X1HR  57067   1
2    2017      1    3   X1HR  66263   1
3    2017      1    4   X1HR  68403   1
4    2017      1    5   X1HR  68053   1
..    ...    ...  ...    ...    ...  ..
163  2017      1    3  X24HR  71346  24
164  2017      1    4  X24HR  70834  24
165  2017      1    5  X24HR  66687  24
166  2017      1    6  X24HR  63214  24
167  2017      1    7  X24HR  69219  24

[168 rows x 6 columns]

### Concat

In [215]:
df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [216]:
df_a = df.iloc[:3, 5:8]
df_b = df.iloc[-3:, 5:8]

In [217]:
df_a

   temp   atemp  humidity
0  9.84  14.395        81
1  9.02  13.635        80
2  9.02  13.635        80

In [219]:
df_b

        temp   atemp  humidity
10883  13.94  15.910        61
10884  13.94  17.425        61
10885  13.12  16.665        66

In [221]:
pd.concat([df_a, df_b])

        temp   atemp  humidity
0       9.84  14.395        81
1       9.02  13.635        80
2       9.02  13.635        80
10883  13.94  15.910        61
10884  13.94  17.425        61
10885  13.12  16.665        66

In [223]:
pd.concat([df_a, df_b], axis = 1)

   index  temp   atemp  humidity   temp   atemp  humidity
0      0  9.84  14.395      81.0    NaN     NaN       NaN
1      1  9.02  13.635      80.0    NaN     NaN       NaN
2      2  9.02  13.635      80.0    NaN     NaN       NaN
3  10883   NaN     NaN       NaN  13.94  15.910      61.0
4  10884   NaN     NaN       NaN  13.94  17.425      61.0
5  10885   NaN     NaN       NaN  13.12  16.665      66.0

In [228]:
pd.concat([df_a, df_b.reset_index()], axis = 1)

   temp   atemp  humidity  index   temp   atemp  humidity
0  9.84  14.395        81  10883  13.94  15.910        61
1  9.02  13.635        80  10884  13.94  17.425        61
2  9.02  13.635        80  10885  13.12  16.665        66

In [232]:
# pd.concat([df_a, df_b], axis = 1, join = "left")

ValueError: Only can inner (intersect) or outer (union) join the other axis

In [253]:
df_b.columns = df_b.columns + "_b"
df_b

TypeError: unsupported operand type(s) for -: 'str' and 'str'

In [251]:
df_a.join(df_b.reset_index(), how ="inner")

   temp   atemp  humidity  index  temp_s_b  atemp_s_b  humidity_s_b
0  9.84  14.395        81  10883     13.94     15.910            61
1  9.02  13.635        80  10884     13.94     17.425            61
2  9.02  13.635        80  10885     13.12     16.665            66

In [238]:
df_b

        temp   atemp  humidity
10883  13.94  15.910        61
10884  13.94  17.425        61
10885  13.12  16.665        66